# Pandas 

## Índice


* [Introducción a Pandas](#Introducción-a-Pandas)
* [Series](#Series)
* [DataFrames](#DataFrames)
    * [Selección e Indexación](#Seleccion-e-Indexacion)
    * [Selección Condicional](#Seleccion-Condicional)
    * [Index](#Index)
* [GroupBy](#GroupBy)
* [Operaciones](#Operaciones)
* [Data Input Output](#Data-Input-Output)

## Introducción a Pandas

* Pandas es una libreria open source construída a partir de NumPy.
* Se utiliza para la manipulación y el análisis de datos ("Es el Excel de Python").
* Mejora productividad y performance por su facilidad para analizar, limiar y preparar datos.
* Permite trabajar con datos de diferente tipo.

**Para instalar Pandas, escribir en la terminal:**

`conda install pandas`

`pip install pandas`


**Para utilizar Pandas, es necesario importar la libreria:**

`import pandas as pd`


Podemos encontrar una extensa documentación en su [Página Web](http://pandas.pydata.org)

## Series

El primer tipo de datos que utilizaremos en Pandas son las Series. 

Una serie es muy similar a un array de NumPy, de hecho estan construidas a partir de arrays de NumPy. Lo que diferencia un NumPy array de una Serie, es que la Serie puede estar indexada por etiquetas o labels (en lugar de solo por el número de posición).

Otra diferencia es que puede contener cualquier tipo de datos, no solo números.

Se pueden construir de diferentes formas, a partir de una lista, un NumPy array o un diccionario:

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
labels

['a', 'b', 'c']

In [4]:
my_list

[10, 20, 30]

In [5]:
arr

array([10, 20, 30])

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

**Usando Listas**

In [7]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

**NumPy Arrays**

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

**Diccionario**

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

**Ejemplos**

Veamos un ejemplo del uso de Series. Creamos dos series: ser1 y ser2:

In [13]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [16]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

Para seleccionar un elemento de la Serie:

In [17]:
ser1['USA']

1

También podemos realizar operaciones entre series:

In [18]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

Podemos pensar a un DataFrame como un conjunto de Series que comparten el mismo indice.

In [19]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import randn

Creamos un DataFrame con numeros random:

In [21]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [22]:
df

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
B -0.914512  0.023452 -1.083903 -0.224695
C  1.068262  0.399721  0.869947  1.235161
D -0.756055  1.332651 -0.714614  0.886632
E  0.060951  0.610268  1.104748 -0.976772

### Seleccion e Indexacion

Seleccionamos una columna del DataFrame:

In [23]:
df['W']

A    0.426127
B   -0.914512
C    1.068262
D   -0.756055
E    0.060951
Name: W, dtype: float64

Vemos que la columna tiene el aspecto de una Serie. Si queremos ver el tipo de objeto podemos escribir:

In [24]:
type(df['W'])

pandas.core.series.Series

Si queremos seleccionar más de una columna, tenemos que escribir los nombres de las columnas en una lista:

In [25]:
df[['W','Z']]

          W         Z
A  0.426127  1.286055
B -0.914512 -0.224695
C  1.068262  1.235161
D -0.756055  0.886632
E  0.060951 -0.976772

Para crear una nueva columna, simplemente la llamamos con un nombre de columna nuevo:

In [26]:
df['nueva'] = df['W'] + df['Z']

In [27]:
df

          W         X         Y         Z     nueva
A  0.426127 -0.338986 -0.003577  1.286055  1.712182
B -0.914512  0.023452 -1.083903 -0.224695 -1.139207
C  1.068262  0.399721  0.869947  1.235161  2.303423
D -0.756055  1.332651 -0.714614  0.886632  0.130577
E  0.060951  0.610268  1.104748 -0.976772 -0.915821

Para eliminar una columna:

`axis=1` hace referencia a las columnas

`axis=0` hace referencia a los índices o filas, y es el valor predeterminado

In [28]:
df.drop('nueva', axis=1)

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
B -0.914512  0.023452 -1.083903 -0.224695
C  1.068262  0.399721  0.869947  1.235161
D -0.756055  1.332651 -0.714614  0.886632
E  0.060951  0.610268  1.104748 -0.976772

**Importante**: al eliminar una columna de esta forma no se esta modificando realmente el DataFrame. Si lo volvemos a llamar vemos que la columna 'nueva' sigue existiendo:

In [29]:
df

          W         X         Y         Z     nueva
A  0.426127 -0.338986 -0.003577  1.286055  1.712182
B -0.914512  0.023452 -1.083903 -0.224695 -1.139207
C  1.068262  0.399721  0.869947  1.235161  2.303423
D -0.756055  1.332651 -0.714614  0.886632  0.130577
E  0.060951  0.610268  1.104748 -0.976772 -0.915821

Para borrar una columna definitivamente de un DataFrame debemos especificar como argumento `inplace=True`

In [30]:
df.drop('nueva', axis=1, inplace=True)

In [31]:
df

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
B -0.914512  0.023452 -1.083903 -0.224695
C  1.068262  0.399721  0.869947  1.235161
D -0.756055  1.332651 -0.714614  0.886632
E  0.060951  0.610268  1.104748 -0.976772

También podemos eliminar filas de la misma forma:

In [32]:
df.drop('E')

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
B -0.914512  0.023452 -1.083903 -0.224695
C  1.068262  0.399721  0.869947  1.235161
D -0.756055  1.332651 -0.714614  0.886632

Para selecionar una fila **a partir del nombre** usamos `df.loc`

In [33]:
df.loc['A']

W    0.426127
X   -0.338986
Y   -0.003577
Z    1.286055
Name: A, dtype: float64

También se puede seleccionar una fila **a partir del numero de indice** usando `df.iloc`

In [34]:
df.iloc[0]

W    0.426127
X   -0.338986
Y   -0.003577
Z    1.286055
Name: A, dtype: float64

Si queremos seleccionar solo algunas filas y columnas, pasamos dos listas (la primera de las filas y la segunda de las columnas deseadas):

In [35]:
df.loc[['A','C'],['X', 'Z']]

          X         Z
A -0.338986  1.286055
C  0.399721  1.235161

### Seleccion Condicional

Podemos realizar una selección condicional de los valores del DataFrame:

In [36]:
df

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
B -0.914512  0.023452 -1.083903 -0.224695
C  1.068262  0.399721  0.869947  1.235161
D -0.756055  1.332651 -0.714614  0.886632
E  0.060951  0.610268  1.104748 -0.976772

In [37]:
df>0

       W      X      Y      Z
A   True  False  False   True
B  False   True  False  False
C   True   True   True   True
D  False   True  False   True
E   True   True   True  False

In [38]:
df[df>0]

          W         X         Y         Z
A  0.426127       NaN       NaN  1.286055
B       NaN  0.023452       NaN       NaN
C  1.068262  0.399721  0.869947  1.235161
D       NaN  1.332651       NaN  0.886632
E  0.060951  0.610268  1.104748       NaN

Para obtener los valores donde las celdas de la columna W son mayores a cero:

In [39]:
df[df['W']>0]

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
C  1.068262  0.399721  0.869947  1.235161
E  0.060951  0.610268  1.104748 -0.976772

Para usar dos o mas condiciones, se utiliza `&` y `|` con parentesis:

In [40]:
df[(df['W'] > 0) & (df['Z'] > 1)]

          W         X         Y         Z
A  0.426127 -0.338986 -0.003577  1.286055
C  1.068262  0.399721  0.869947  1.235161

### Index

Podemos resetear el indice a un valor numerico de 0, 1,..., n

Se crea una nueva columna con los indices originales:

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.426127 -0.338986 -0.003577  1.286055
1     B -0.914512  0.023452 -1.083903 -0.224695
2     C  1.068262  0.399721  0.869947  1.235161
3     D -0.756055  1.332651 -0.714614  0.886632
4     E  0.060951  0.610268  1.104748 -0.976772

Si queremos agregar una columna nueva con otros indices, primero creamos una lista con los nombres:

In [42]:
nuevo_ind = 'CA NY WY OR CO'.split()

In [43]:
nuevo_ind

['CA', 'NY', 'WY', 'OR', 'CO']

Luego agregamos la lista como columna nueva:

In [44]:
df['States'] = nuevo_ind

In [45]:
df

          W         X         Y         Z States
A  0.426127 -0.338986 -0.003577  1.286055     CA
B -0.914512  0.023452 -1.083903 -0.224695     NY
C  1.068262  0.399721  0.869947  1.235161     WY
D -0.756055  1.332651 -0.714614  0.886632     OR
E  0.060951  0.610268  1.104748 -0.976772     CO

Por ultimo, elegimos la columna que queremos que sea el nuevo indice:

In [46]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.426127 -0.338986 -0.003577  1.286055
NY     -0.914512  0.023452 -1.083903 -0.224695
WY      1.068262  0.399721  0.869947  1.235161
OR     -0.756055  1.332651 -0.714614  0.886632
CO      0.060951  0.610268  1.104748 -0.976772

Importante: para que estos cambios sean permanentes, debemos especificarlo escribiendo `inplace=True`

In [47]:
df

          W         X         Y         Z States
A  0.426127 -0.338986 -0.003577  1.286055     CA
B -0.914512  0.023452 -1.083903 -0.224695     NY
C  1.068262  0.399721  0.869947  1.235161     WY
D -0.756055  1.332651 -0.714614  0.886632     OR
E  0.060951  0.610268  1.104748 -0.976772     CO

In [48]:
df.set_index('States', inplace=True)

In [49]:
df

               W         X         Y         Z
States
CA      0.426127 -0.338986 -0.003577  1.286055
NY     -0.914512  0.023452 -1.083903 -0.224695
WY      1.068262  0.399721  0.869947  1.235161
OR     -0.756055  1.332651 -0.714614  0.886632
CO      0.060951  0.610268  1.104748 -0.976772

## GroupBy

GroupBy nos permite agrupar filas y aplicar funciones sobre las mismas.

Vamos a crear un DataFrame a partir de un diccionario:

In [50]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Empleado':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Ventas':[200,120,340,124,243,350]}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

  Empresa Empleado  Ventas
0    GOOG      Sam     200
1    GOOG  Charlie     120
2    MSFT      Amy     340
3    MSFT  Vanessa     124
4      FB     Carl     243
5      FB    Sarah     350

Usando el metodo `.groupby()` podemos agrupar los datos, por ejemplo segun el nombre de la Empresa. Esto va a crear un objeto del tipo `DataFrameGroupBy`

In [53]:
df.groupby('Empresa')

Podemos guardar este objeto en una variable:

In [54]:
por_empresa = df.groupby('Empresa')

Y aplicarle metodos para, por ejemplo, realizar calculos:

In [55]:
por_empresa.mean()

         Ventas
Empresa
FB        296.5
GOOG      160.0
MSFT      232.0

In [56]:
por_empresa.std()

             Ventas
Empresa
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [57]:
por_empresa.min()

        Empleado  Ventas
Empresa
FB          Carl     243
GOOG     Charlie     120
MSFT         Amy     124

In [58]:
por_empresa.max()

        Empleado  Ventas
Empresa
FB         Sarah     350
GOOG         Sam     200
MSFT     Vanessa     340

In [59]:
por_empresa.count()

         Empleado  Ventas
Empresa
FB              2       2
GOOG            2       2
MSFT            2       2

In [60]:
por_empresa.describe()

        Ventas
         count   mean         std    min     25%    50%     75%    max
Empresa
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
por_empresa.describe().transpose()

Empresa               FB        GOOG        MSFT
Ventas count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000

In [62]:
por_empresa.describe().transpose()['GOOG']

Ventas  count      2.000000
        mean     160.000000
        std       56.568542
        min      120.000000
        25%      140.000000
        50%      160.000000
        75%      180.000000
        max      200.000000
Name: GOOG, dtype: float64

### Operaciones

In [63]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Para ver los valores unicos `.unique()`

In [64]:
df['col2'].unique()

array([444, 555, 666])

Para ver la cantidad de valores unicos `.nunique()`

In [65]:
df['col2'].nunique()

3

Para ver cuantas veces ocurre cada valor `.value_counts()`

In [66]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

**Tambien podemos aplicar funciones a todo un DataFrame usando el metodo `.apply()`**

Definimos una funcion:

In [67]:
def por2(x):
    return x*2

In [68]:
df['col2'].apply(por2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

Tambien se pueden aplicar funciones a strings:

In [69]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

**Una forma mas simple de aplicar una funcion en una sola linea es usando `lambda`**

In [70]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

**Para eliminar una columna:**

*Si queremos que el cambio sea permanente hay que aclarar `inplace:True`*

In [71]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [72]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

**Para conocer los nombres de las filas y columnas:**

In [73]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [74]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Para ordenar los valores por columnas:**

*Ver que el indice se mantiente*

In [75]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

**Para ver si hay algun valor Null**

In [76]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**Pivot Table**

In [77]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [78]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [79]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input-Output

Importar datos de:
- CSV
- Excel
- HTML
- SQL

Para trabajar con HTML y SQL hace falta instalar las siguientes librerias:

`conda install sqlalchemy`

`conda install lxml`

`conda install html5lib`

`conda install BeautifulSoup4`

**Importante: los archivos CSV y Excel deben estar en la misma carpeta en la que estoy trabajando**

*Para ver en que carpeta estoy:* `pwd`

In [80]:
pwd

'/Users/ari/GIT/python_introduccion/notebooks'

### CSV Input

In [81]:
df = pd.read_csv('Salaries.csv')

In [82]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN
10,11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.90,NaN,299494.17,299494.17,2011,NaN,San Francisco,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.00,87082.62,110804.30,NaN,297608.92,297608.92,2011,NaN,San Francisco,NaN
12,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580.02,0.00,0.00,NaN,294580.02,294580.02,2011,NaN,San Francisco,NaN
13,14,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,NaN,292671.62,292671.62,2011,NaN,San Francisco,NaN
14,15,DAVID FRANKLIN,"BATTALION CHIEF, (FIRE DEPARTMENT)",174872.64,74050.30,37424.11,NaN,286347.05,286347.05,2011,NaN,San Francisco,NaN
15,16,RICHARD CORRIEA,"COMMANDER III, (POLICE DEPARTMENT)",198778.01,73478.20,13957.65,NaN,286213.86,286213.86,2011,NaN,San Francisco,NaN
16,17,AMY HART,DEPARTMENT HEAD V,268604.57,0.00,16115.86,NaN,284720.43,284720.43,2011,NaN,San Francisco,NaN
17,18,SEBASTIAN WONG,"CAPTAIN, EMERGENCYCY MEDICAL SERVICES",140546.87,119397.26,18625.08,NaN,278569.21,278569.21,2011,NaN,San Francisco,NaN
18,19,MARTY ROSS,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.63,69626.12,38115.47,NaN,276434.22,276434.22,2011,NaN,San Francisco,NaN
19,20,ELLEN MOFFATT,ASSISTANT MEDICAL EXAMINER,257510.59,880.16,16159.50,NaN,274550.25,274550.25,2011,NaN,San Francisco,NaN
20,21,VENUS AZAR,ASSISTANT MEDICAL EXAMINER,257510.48,0.00,16679.79,NaN,274190.27,274190.27,2011,NaN,San Francisco,NaN
21,22,JUDY MELINEK,ASSISTANT MEDICAL EXAMINER,257510.44,377.21,15883.56,NaN,273771.21,273771.21,2011,NaN,San Francisco,NaN
22,23,GEORGE GARCIA,"CAPTAIN, FIRE SUPPRESSION",140546.88,93200.58,39955.25,NaN,273702.71,273702.71,2011,NaN,San Francisco,NaN
23,24,VICTOR WYRSCH,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.63,77896.14,24083.86,NaN,270672.63,270672.63,2011,NaN,San Francisco,NaN
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN
25,26,GREGORY SUHR,CHIEF OF POLICE,256470.41,0.00,11522.18,NaN,267992.59,267992.59,2011,NaN,San Francisco,NaN
26,27,JOHN HANLEY,"CAPTAIN, FIRE SUPPRESSION",92080.80,40008.00,133695.76,NaN,265784.56,265784.56,2011,NaN,San Francisco,NaN
27,28,RAYMOND GUZMAN,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.59,80706.88,16063.99,NaN,265463.46,265463.46,2011,NaN,San Francisco,NaN
28,29,DENISE SCHMITT,DEPUTY CHIEF III (POLICE DEPARTMENT),261717.60,0.00,2357.00,NaN,264074.60,264074.60,2011,NaN,San Francisco,NaN
29,30,MONICA FIELDS,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",246225.60,0.00,15140.54,NaN,261366.14,261366.14,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148624,148625,Lorraine Rosenthal,Senior Clerk,0.00,0.00,12.89,0.00,12.89,12.89,2014,NaN,San Francisco,NaN
148625,148626,Renato C Gurion,Registered Nurse,0.00,0.00,6.00,1.24,6.00,7.24,2014,NaN,San Francisco,NaN
148626,148627,Paulet Gaines,Account Clerk,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148627,148628,Brett A Lundberg,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148628,148629,Mark W Mcclure,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148629,148630,Elizabeth Iniguez,Transcriber Typist,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148630,148631,Randy J Keys,Carpenter,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148631,148632,Andre M Johnson,Communications Dispatcher 1,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148632,148633,Sharon D Owens-Webster,Protective Services Worker,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148633,148634,Edward Ferdinand,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148634,148635,David M Turner,Transit Car Cleaner,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148635,148636,James S Kibblewhite,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148636,148637,Andrew J Enzi,Arborist Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148637,148638,Kadeshra D Green,Transit Fare Inspector,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148638,148639,Lennard B Hutchinson,Electrician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148639,148640,Richard A Talbert,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148640,148641,Charlene D Mccully,Parking Control Officer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148641,148642,Raphael Marquis Goins,Museum Guard,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148642,148643,Dominic C Marquez,Sign Worker,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148643,148644,Kim Brewer,Parking Control Officer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148646,148647,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,NaN

### CSV Output

*Si no quiero que se guarden los indices:* `index=False`

In [83]:
df.to_csv('My_outoput.csv', index=False)

### Excel Input 

*Importante: Pandas puede importar solo datos de Excel, no formulas ni imagenes. Si hay imagenes o macros puede fallar la importacion.*

In [84]:
# Agregar archivo de Excel para que funcione el input
# df = pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

### Excel Output

In [85]:
# df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

### HTLM Input

In [86]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [87]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

## Referencias

 * [Pandas Documentation](http://pandas.pydata.org/pandas-docs/stable/)

 * [Python for Data Science and Machine Learning Bootcamp](https://www.udemy.com/share/10008ABEAfdFxVRn4=/)

## Licencia

<a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/"><img alt="Licencia de Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" /></a><br />Este documento se destribuye con una <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">licencia Atribución CompartirIgual 4.0 Internacional de Creative Commons</a>.

© 2018. Infiniem Lab DSP. ** infiniemlab.dsp@gmail.com** . Introducción informal a Python3 (CC BY-SA 4.0)